Autodesk.Revit.DB.IFC.IFCAnyHandle.Unset
Unsets the handle.
Since:
2012

Autodesk.Revit.DB.IFC.IFCAnyHandle.IsSubTypeOf(System.String)
Determines whether the instance is an instance of the specified instance type or a subtype of this instance type.
typeName:
The instance type name.
Returns:
True if the instance is an instance of the specified instance type or its subtype, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.IsTypeOf(System.String)
Determines whether the instance is an instance of exactly the specified instance type.
typeName:
The instance type name.
Returns:
True if the instance is an instance of the specified instance type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.UnsetAttribute(System.String)
Unsets the attribute value.
name:
The attribute name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{System.Boolean})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{System.Int32})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{System.Double})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{System.String})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet`1{Autodesk.Revit.DB.IFC.IFCAnyHandle})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{System.Boolean})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{System.Int32})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{System.Double})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{System.String})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList`1{Autodesk.Revit.DB.IFC.IFCAnyHandle})
Sets the attribute value.
name:
The attribute name.
values:
The values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Boolean)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Double)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Int32)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.String)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,Autodesk.Revit.DB.IFC.IFCData)
Sets the attribute value.
name:
The attribute name.
value:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.GetAttribute(System.String)
Gets the attribute by name.
name:
The name.
Returns:
The value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.CreateAggregateAttribute(System.String)
Creates an attribute that is an aggregate. TODO: Rename to createAggregateByRef
name:
The attribute name.
Returns:
The aggregate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCAnyHandle.Delete
Deletes the handle.
Since:
2012

Autodesk.Revit.DB.IFC.IFCAnyHandle.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCAnyHandle.HasValue
Identifies if the handle is empty or contains a value.
Since:
2012

Autodesk.Revit.DB.IFC.IFCAnyHandle.StepId
The step id of the handle. Valid only for import.
Since:
2014

Autodesk.Revit.DB.IFC.IFCAnyHandle.TypeName
The name of the type of the handle.
Since:
2012

Autodesk.Revit.DB.IFC.IFCAnyHandle.Id
The integer identifier for the handle.
Since:
2012

Autodesk.Revit.DB.IFC.IFCAnyHandle.GetHashCode
Gets the integer value of the id as hash code

Autodesk.Revit.DB.IFC.IFCAnyHandle.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  Another object.

Autodesk.Revit.DB.IFC.IFCAnyHandle.op_Inequality(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Determines whether two IFCAnyHandles are different.
first: The first IFCAnyHandle.
second: The second IFCAnyHandle.
Returns: True if the IFCAnyHandles are different; otherwise, false.

Autodesk.Revit.DB.IFC.IFCAnyHandle.op_Equality(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Determines whether two IFCAnyHandles are the same.
first: The first IFCAnyHandle.
second: The second IFCAnyHandle.
Returns: True if the IFCAnyHandles are the same; otherwise, false.

Autodesk.Revit.DB.IFC.IFCAnyHandle
A handle representing an item in an IFC file.
Remarks:
Handles are used to populate each line item in an IFC file.  Each handle is assigned a unique identifier
(an integer) which can be seen in the file contents at the start of the line.
Since:
2012